# RasterVerticalScale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RasterVerticalScale Property
ParameterTypeId Class See Also
---
"Vertical Scale"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RasterVerticalScale { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RasterVerticalScale As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RasterVerticalScale {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace